#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiap/gh-actions/runs/run-3ofMjhjSKQtzxD6G

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=lucky-liger]
data.aws_ami.ubuntu: Refreshing...
aws_security_group.web-sg: Refreshing state... [id=sg-028e316b0b873e0de]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-0e3a6d8ff4c8fe246]
aws_instance.web: Refreshing state... [id=i-04d9245e7425cb903]
aws_instance.web: Drift detected (update)
aws_security_group.web-sg: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.new_user_access_key will be created
  + resource "aws_iam_access_key" "new_user_access_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "example_user"
    }

  # aws_iam_user.new_user will be created
  + resource "aws_iam_user" "new_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "example_user"
      + path          = "/"
      + tags          = {
          + "Name" = "Example User"
        }
      + tags_all      = {
          + "Name" = "Example User"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.new_user_policy_attachment will be created
  + resource "aws_iam_user_policy_attachment" "new_user_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + user       = "example_user"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @FabianoCarneiro, Action: `pull_request`*